tutorials/fluidSolidInteraction/beamInCrossFlow/oscillatingElasticBeam/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

//internalField   uniform (0.0001 0 0);
internalField   uniform (0 0 0);

boundaryField
{
    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            paraboloidInletVelocity;
        maxVelocity     0.2;
        yWidth          0.2;
        zWidth          0.4;
        timeVarying     yes;
        timeAtMaxVelocity 1.0;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
